{ "events":[
{"key":"46","title":"Storytelling with a Mission","speaker":"The Genki Spark","location":"Goldwin Smith Hall 132","timeSlot":9,"description":"In this workshop, we will explore how personal stories told on and off the stage can be a powerful vehicle for social change. Come learn how the pan-Asian women's arts group, The Genki Spark uses personal narratives and Japanese taiko drumming to develop leadership, bash stereotypes, and inspire college students nationwide."},
{"key":"47","title":"Lifting the Veil: On Illusions Surrounding Hinduism","speaker":"Abhi Ramakrishnan, Smita Bhoopatiraju, & Kimaya Raje","location":"Goldwin Smith Hall 142","timeSlot":9,"description":"Our aim is to provide a background and create discourse about the history of Hinduism, variations in practice, and issues among the Hindu-American community. We plan to touch on how interfaith events can be used to strengthen minority communities. In addition, we’d like to discuss Hinduism’s role in broader issues--such as Asian-American identity--facing the nation and world today on the sociopolitical stage. For those from Cornell, we wish to provide information about HSC’s goals, events, and presence on campus.\n\nTrigger/content warning: Discussion of discrimination, religion, and politics"},
{"key":"48","title":"API History: Where the Past Meets Your Present","speaker":"Mayta Lor","location":"Goldwin Smith Hall 162","timeSlot":9,"description":"How have Asian and Pacific Islanders contributed to the growth and diversity of the U.S? How can individuals from such a diverse community share their stories, advocate for inclusion, and create leadership opportunities? In this workshop, participants will learn about how their personal histories fit into a larger community narrative. Through self reflection, personal sharing, and group discussion, participants will find the intersections of the past and present in their own lives."},
{"key":"49","title":"Tongue Tied: Interpreting Asian American Emotion","speaker":"Luna Ly, Sean McGovern","location":"Goldwin Smith Hall164","timeSlot":9,"description":"Do we, as AAPI’s, face unique challenges when expressing emotions? Have you ever felt like it’s hard to talk to your family or community about emotionally-charged issues like sexuality or gender identity? We (Luna and Sean) often find ourselves trying to bridge a linguistic divide that stems from an intersectional struggle with culture, translation, gender, and immigrant identity. In this workshop, we’ll look at media tropes of AAPI emotion and compare them to our linguistic realities. This session will help you think critically about your own experiences and how they fit into a larger context of AAPI emotional expression.\n\nTrigger/content warning: Intergenerational trauma, mental health, sexuality, gender identity, language barriers"},
{"key":"50","title":"Faculty Workshop — Campaigning for Asian American Studies","speaker":"Professors Shelley Wong, Viranjini Munasinghe, & Derek Chang","location":"Goldwin Smith Hall G76","timeSlot":9,"description":"There are currently only two colleges (Binghamton and NYU) on the East Coast that offer an Asian American Studies (AAS) major. What does this mean, and what can we learn from people who have spent their careers teaching and fighting for AAS? Join three faculty members from Cornell’s own Asian American Studies Program as they give a brief overview of AAS as an academic field and focal point for student organizing, and then field questions from attendees who are interested or invested in AAS. What is AAS? Why does it matter? How can you campaign for AAS at your own campus? Students are invited to share."},
{"key":"51","title":"Outside the Lunchbox","speaker":"Sam Ng, Tony Tran, & Aishika Jennela","location":"Morrill Hall 106","timeSlot":9,"description":"What we eat is one of the most important decisions we make each day. Yet, when discussing how food influence our lives, there’s a large absence of discourse. Outside of “comfort food” and your family’s home cooking, how has food influenced or challenged our upbringings? What are the ways food can be interpreted as political? How has gentrification of our communities and the concepts of food challenged notions of “authenticity.” “Outside the Lunchbox” aims to provide attendees a space to challenge themselves to think critically about race and food. We will be discussing the intersection of food and our experiences as Asian Americans in the contemporary moment."},
{"key":"52","title":"The Importance of Speaking Out","speaker":"Olivia Zheng & Connie Rab","location":"Morrill Hall 107","timeSlot":9,"description":"You have an opinion. You want to speak up. Why don’t you? In this workshop, we will investigate the barriers to why we sometimes feel uncomfortable speaking out. We will interrogate the concept of complicity, discuss why Asian Americans are often conditioned to “keep our heads down,” and practice strategies to voice our opinions. We will work together to develop an action plan, placing a focus on transitioning from awareness to action."},
{"key":"53","title":"Between Two Worlds: Empowering Asian/Asian American Adoptees","speaker":"Phoebe Balascio & Kathryn Holz","location":"Morrill Hall 110","timeSlot":9,"description":"Attendees will cover four relevant topics impacting AAPI adoptees today: misperceptions surrounding adoption stories, mental health, birth family searching, and adoption in the media. Group discussions will introduce participants to new attitudes and educate them about ways to voice their own perspectives surrounding their adoption story. This workshop is an opportunity for adoptees to connect with others who have endured similar challenges and experiences. The facilitators will provide resources for those interested in becoming more involved in the AAPI adoptee community."},
{"key":"54","title":"Leadership as expanding our empathy and sharing knowledge... so that we have the tools to do something! / shake things up!!","speaker":"Nayab Khan, Miru Osuga","location":"Morrill Hall 111","timeSlot":9,"description":"At UPenn, the Pan-Asian American Community House leads a program, the Asian Pacific American Leadership Initiative (APALI), where students learn from activities and discussion as well as from other peoples’ experiences. It is designed to encourage APA activism through exploration of APA identity and discussion of APA issues. The first half of the workshop will be led as if it is an APALI session. The second half of the workshop will focus on creating a program like APALI within people’s own universities and colleges."},
{"key":"55","title":"Settler Colonialism and BDS","speaker":"Hadiyah Chowdhury","location":"Rockefeller Hall 102","timeSlot":9,"description":"Because the Asian American movement is not only about anti-racism, but also about destabilizing imperialist power structures globally, we will to provide a history of the creation of the Israeli state, followed by an understanding of the structures of power that make Palestinian activism so difficult in the contemporary, American university. We will be grounding this workshop in an understanding of settler colonialism as it applies to both Palestine and the United States. We will then talk about why BDS (Boycott, Divestment, Sanctions) is a strategy Students for Justice in Palestine supports nationally and how we can run campaigns specifically targeted towards the administration and other student groups."},
{"key":"56","title":"Resilience Through Art: How SEAs Have Healed, Mobilized and Resisted Through Creative Modes of Self-Expression","speaker":"Dianne Lê","location":"Rockefeller Hall 103","timeSlot":9,"description":"Art is a powerful tool for social change. Join Dianne Le to learn about art as a form of communication, resilience, and healing. This workshop explores how youth have mobilized and advocated through breakdancing, spoken word, and other forms of artistic expression. Learn how to bridge communicative, generational, and cultural gaps within Southeast Asian communities to cultivate new means of healing, resistance, and advocacy.\n\nTrigger/content warning: war, PTSD, sexism, abuse, divorce"},
{"key":"57","title":"Anti-Blackness in the Blasian Context","speaker":"Savannah Lagmay & Chelsey Gao","location":"Rockefeller Hall 104","timeSlot":9,"description":"When discussing AAPI identity, Blasian-- individuals of mixed African and Asian descent--narratives are often excluded in mainstream conversations. How do we tackle this anti blackness within our own communities? Many factors affect Blasian identity and portrayal in the AAPI community, from history within the US to transnationally in modern media representations. “Anti Blackness in the Blasian Context” aims to discuss experiences being and growing up Blasian, how to prioritize Blasian narratives in the community, and how to navigate conversations of anti blackness from and regarding Blasian perspectives."},
{"key":"58","title":"Asian American Christianity","speaker":"Christine Lee & David Choi","location":"Rockefeller Hall 105","timeSlot":9,"description":"Our identities and experiences are made up of many things, one of which often includes faith background. Despite the monumental role of faith in many people’s lives, Asian/Americans in Christian spaces are not often given the space or the language to understand what it means to be both Asian/American and Christian. One might ask: Does my Asianness even matter to God? This workshops seeks to unpack the intersections of these two points of identity, as well as give an introduction to Asian American theology. Folks do not need to be Christian to participate."},
{"key":"59","title":"My Name Is...","speaker":"Eurie Kim","location":"Rockefeller Hall 110","timeSlot":9,"description":"\"Personally, growing up as an Asian American without an \"\"Americanized\"\" name, I was subject to jokes about my name. These jokes were not necessarily cruel in nature, but for a good amount of time, I think I resented my own name, although eventually, I grew to appreciate and love my name. Through this workshop, I wish to open a discussion of the power of names; what our (as in the APIA community) names mean to us, especially for those of us with non-Americanized first names; and to expand this to question what names we refer to ourselves but also to others outside our community.\"\n\nTrigger/content warning: discussion of racial slurs"},
{"key":"60","title":"We Are the Ones We’ve Been Waiting For","speaker":"Helena Wong, Israt Audry, Van Sam","location":"Rockefeller Hall 112","timeSlot":9,"description":"AAPIs have always been involved in movements for justice.  In this period of escalated attacks on communities of color, poor communities, LGBTQ people, women's bodies, the environment, etc., it is important for us to build common language and across identities.  Facilitators will work with participants to understand the current moment, and share the work of organizations from across the country who are working to fight systemic racism and articulating a vision for a world we build together."},
{"key":"61","title":"Disambiguating Nonprofits: A Panel with APAICS, CKA, and Planned Parenthood Generation Action","speaker":"Anthony Reyes, other facilitators TBD, APAICS","location":"Rockefeller Hall 115","timeSlot":9,"description":"“”"},
{"key":"62","title":"Critical Nostalgia: Heritage & Asian Artists in the North American Diaspora","speaker":"Florence Yee","location":"Rockefeller Hall 127","timeSlot":9,"description":"Often caught between the White gaze of the art world and our own self-romanticizing pitfalls, visual artists have used critical histories to help dismantle stereotypes of exoticism and Orientalism. At the same time, there are aspects of our identity that could become complicit to settler-colonialism and other forms of oppression if left unspoken. This workshop explores the nuances of dis/empowerment when it comes to denying or including visual elements of our heritage in artwork. It shows the ways in which Asian artists from the diaspora have navigated their identity and its presentation through a critical nostalgia. "},
{"key":"63","title":"Power and Privilege","speaker":"Andrew Lo, Stephanie Wong, & Sina Uipi, OCA Asian Pacific American Advocates","location":"Rockefeller Hall 128","timeSlot":9,"description":"Everyone has a different set of life experiences and circumstances that provides them advantages in some areas and weaknesses in other. This workshop identifies the ways that privilege expresses itself in their lives and also provide them with strategies on how to use their own privilege to effect change."},
{"key":"64","title":"LGBTQQIA+ Healing Space","speaker":"Kevin Davis & Scott Ho","location":"Rockefeller Hall 185","timeSlot":9,"description":"The point of the workshop is to share the experiences of Asian-American LGBTQQIA+ individuals in a safe space in an attempt to create a sense of community at this conference. This workshop will be held in a roundtable discussion so that everyone can share. There will be no formal hierarchy. Instead the facilitators will act as guides through the discussion. \n\nTrigger/content warning: rape, sexual assault, abuse, self injurious behavior, mental illness, suicide"},
{"key":"65","title":"Cut and Paste Revolution: A Zine Workshop","speaker":"Mimi Thi Nguyen","location":"Rockefeller Hall 230","timeSlot":9,"description":"Zines (pronounced “zeens”) and self-publishing have a long and rich history, from pamphlets during moments of political uprising, to fan fiction, to underground zines documenting the punk scene in the 1970s and 1980s. The 1990s saw an explosion of zine publishing, with everything from poetry and personal writing, to food and record reviews, to zines about work, cats, health, feminism, race and racism, and everything in between. What all zines have in common is that their writers and editors (often the same people/person) feel like they have something important to say that they would like to share with others. In this workshop, we will discuss how zines can create a collective conversation, and collaborate on making a conference zine and/or individual one-page zines. "},
{"key":"66","title":"Reimagining AAPI Identity in Visual Culture","speaker":"Kate Pangilinan & Hannah Song","location":"Rockefeller Hall B16","timeSlot":9,"description":"How do you currently see AAPI voices represented in media? Can you relate? This workshop will take a close look at AAPI representation within tv, film, art, and social media. We aim to create a space where attendees will be able to gain a deeper understanding of the importance of inclusive storytelling, the development of identity, and building shared cultural knowledge. We will provide the framework and questions for people to evaluate the portrayal of AAPI individuals within art, media, and the growing digital landscape. This workshop highlights the responsibility of storytellers (whether written, visual, or through production) to create the future. Through “Reimagining AAPI Identity in Visual Culture,” we allow folx to recognize the impact of each of our authentic voices—encouraging people to have agency and insert new perspectives and conversations into contemporary media culture."},
{"key":"67","title":"Resist, Fight, Mobilize Through Asian Immigration in the U.S.","speaker":"Huy Tu & Mike Chiang","location":"Rockefeller Hall 132","timeSlot":9,"description":"We shall share and look at the historical context and resistance background that surrounds history of Asian immigration. As we break down different aspects of immigration and citizenship, we hope to expose a new understanding of how the history of immigration in the US has been limiting for many communities and shaping our experiences. We will get the opportunity to build community and force in this workshop through sharing personal stories of immigration with resistance strategies and experience. Through this new lens of immigration and citizenship history, we can fight back against racism, xenophobia, and U.S imperialism."},
{"key":"22","title":"Be Loud! Be Proud! Be Genki!","speaker":"The Genki Spark","location":"Goldwin Smith Hall 132","timeSlot":6,"description":"Based in Boston, The Genki Spark is a pan-Asian women’s arts and advocacy group using personal narratives and Japanese taiko drumming to develop leadership, bash stereotypes, and inspire. Genki is a Japanese word that means “happy, healthy, and full of life.” Explore how personal stories told through the arts can be a powerful vehicle for social change. Be prepared to meet new people and try out taiko drumming for yourself! \n\nTrigger/content warning: Loud sound"},
{"key":"23","title":"Lifting the Veil: On Illusions Surrounding Hinduism","speaker":"Abhi Ramakrishnan, Smita Bhoopatiraju, & Kimaya Raje","location":"Goldwin Smith Hall 142","timeSlot":6,"description":"In this workshop, we will map the history of Hinduism, how it is practiced today, variations in in practice, misconceptions, and delve into issues among the community of Hindus in America. We will discuss how interfaith events can be used to strengthen minority communities. In addition, we’ll touch on how Hinduism can affect broader issues in the nation and world today on the political stage. [For those from Cornell], we wish to provide information about Hindu Student Council’s presence on campus, its goals, and events!\n\nOur aim is to provide a background and create discourse about the history of Hinduism, variations in practice, and issues among the Hindu-American community. We plan to touch on how interfaith events can be used to strengthen minority communities. In addition, we’d like to discuss Hinduism’s role in broader issues--such as Asian-American identity--facing the nation and world today on the sociopolitical stage. For those from Cornell, we wish to provide information about HSC’s goals, events, and presence on campus.\n\nTrigger/content warning: Discussion of discrimination, religion, and politics"},
{"key":"24","title":"Pitfalls of Positivity: Using Media Literacy to Think Critically","speaker":"Marcus Tran Degnan","location":"Goldwin Smith Hall 144","timeSlot":6,"description":"This workshop will offer students a space to think more critically about their creative content. It will challenge students by first providing a walkthrough on how to think more in-depth with media analysis of current popular news sources that highlight normative representations of Asian Americans. It will then be followed by a group writing exercise/assignment to emphasize the collaborative nature of the writing process. Students will walk away from this session with an informed discussion on how to develop creativity while being conscious of social justice themes and how they pertain to marginalized people. "},
{"key":"25","title":"API History: Where the Past Meets Your Present","speaker":"Mayta Lor","location":"Goldwin Smith Hall 162","timeSlot":6,"description":"How have Asian and Pacific Islanders contributed to the growth and diversity of the U.S? How can individuals from such a diverse community share their stories, advocate for inclusion, and create leadership opportunities? In this workshop, participants will learn about how their personal histories fit into a larger community narrative. Through self reflection, personal sharing, and group discussion, participants will find the intersections of the past and present in their own lives."},
{"key":"26","title":"Tongue Tied: Interpreting Asian American Emotion","speaker":"Luna Ly, Sean McGovern","location":"Goldwin Smith Hall 164","timeSlot":6,"description":"Do we, as AAPI’s, face unique challenges when expressing emotions? Have you ever felt like it’s hard to talk to your family or community about emotionally-charged issues like sexuality or gender identity? We (Luna and Sean) often find ourselves trying to bridge a linguistic divide that stems from an intersectional struggle with culture, translation, gender, and immigrant identity. In this workshop, we’ll look at media tropes of AAPI emotion and compare them to our linguistic realities. This session will help you think critically about your own experiences and how they fit into a larger context of AAPI emotional expression.\n\nTrigger/content warning: Intergenerational trauma, mental health, sexuality, gender identity, language barriers"},
{"key":"27","title":"Homeland: Finding Place Between Asia and America","speaker":"Ada Zhang, Sabrina Cheung, & Helen Yang","location":"Morrill Hall 106","timeSlot":6,"description":"\"What is home? Constructing an identity around place as an Asian American varies widely from person to person, whether that means choosing \"\"between\"\" Asia and America or shaping an identity that lies somewhere \"\"between\"\" Asia and America. This workshop first delves into the basics of how AAPIs are categorized, touching on the racial binaries of Asia versus America, the perpetual foreigner myth, and AAPI communities' place in America. Then, we will explore and discuss issues pertaining to the idea of \"\"home\"\" for Asian Americans; the search for belonging in Asia or America or both; the relationship with language, culture, and heritage; and the role of place and home in different regions of America.\""},
{"key":"28","title":"Intergenerational Communication","speaker":"JR Kuo, NAAPIMHA","location":"Morrill Hall 107","timeSlot":6,"description":"Too often, Asian American and Pacific Islander students find themselves at a loss on how to communicate to older generations about general or their own mental health topics. Language barriers and social stigmas often prevent these discussions from happening. This workshop breaks down issues surrounding the lack of conversation within families about mental health, and seeks to provide resources and solutions for better intergenerational communication."},
{"key":"29","title":"Grace Lee Boggs and the Black Radical Tradition","speaker":"Emily Dong & Archishman Raju","location":"Morrill Hall 110","timeSlot":6,"description":"Grace Lee Boggs was a long-time activist, thinker, and revolutionary. She made an essential contribution to a history that defines our time today: from the first March on Washington to the Black Power and revolutionary union movements. With her husband and comrade Jimmy Boggs, she would spend most of her life in Detroit, supporting and leading the struggles throughout the city’s industrial boom and post-industrial devastation. We'll talk about Grace's roots in the Black Radical Tradition, challenge the way current Asian American activist communities frame her, and draw lessons from her ideas and life to inform our own pursuit for transformative justice.  "},
{"key":"30","title":"Leadership as expanding our empathy and sharing knowledge... so that we have the tools to do something! / shake things up!!","speaker":"Nayab Khan, Miru Osuga","location":"Morrill Hall 111","timeSlot":6,"description":"At UPenn, the Pan-Asian American Community House leads a program, the Asian Pacific American Leadership Initiative (APALI), where students learn from activities and discussion as well as from other peoples’ experiences. It is designed to encourage APA activism through exploration of APA identity and discussion of APA issues. The first half of the workshop will be led as if it is an APALI session. The second half of the workshop will focus on creating a program like APALI within people’s own universities and colleges."},
{"key":"31","title":"Settler Colonialism and BDS","speaker":"Hadiyah Chowdhury","location":"Rockefeller Hall 102","timeSlot":6,"description":"Because the Asian American movement is not only about anti-racism, but also about destabilizing imperialist power structures globally, we will to provide a history of the creation of the Israeli state, followed by an understanding of the structures of power that make Palestinian activism so difficult in the contemporary, American university. We will be grounding this workshop in an understanding of settler colonialism as it applies to both Palestine and the United States. We will then talk about why BDS (Boycott, Divestment, Sanctions) is a strategy Students for Justice in Palestine supports nationally and how we can run campaigns specifically targeted towards the administration and other student groups."},
{"key":"32","title":"Resilience Through Art: How SEAs Have Healed, Mobilized and Resisted Through Creative Modes of Self-Expression","speaker":"Dianne Lê","location":"Rockefeller Hall 103","timeSlot":6,"description":"Art is a powerful tool for social change. Join Dianne Le to learn about art as a form of communication, resilience, and healing. This workshop explores how youth have mobilized and advocated through breakdancing, spoken word, and other forms of artistic expression. Learn how to bridge communicative, generational, and cultural gaps within Southeast Asian communities to cultivate new means of healing, resistance, and advocacy.\n\nTrigger/content warning: war, PTSD, sexism, abuse, divorce"},
{"key":"33","title":"Race, Gender, and the Construction of Asian American Masculinity","speaker":"Nicholas Hatcher","location":"Rockefeller Hall 104","timeSlot":6,"description":"For people of color, gender is often deviant by default. Black and Latinx men are seen as hyper masculine and women as aggressive or overtly sexual. Asian men are emasculated and Asian women are considered submissive. In this workshop, we explore the history and construction of Asian American masculinity and explore what that means in terms of toxic masculinity, mental health, and queer identity."},
{"key":"34","title":"Breaking the GenerAsianal Boundaries","speaker":"Timothy Chow & Shawn Chen","location":"Rockefeller Hall 105","timeSlot":6,"description":"A discussion about the relationship between Asian-Americans and their parents. In particular, how the contrasting backgrounds and cultures between generations express emotions and how that has affected Asian-Americans growing up. Also, how mainstream media in America has set expectations for family relations. We hope this workshop will encourage Asian-Americans to have an open discussion with their parents."},
{"key":"35","title":"Decolonizing Education: The Fight for Asian American Studies","speaker":"Xiao Yin Ma & Alice Li","location":"Rockefeller Hall 112","timeSlot":6,"description":"The greatest irony in the current system is that universities, which are designed to provide us with an education, are really the inhibitors of knowledge - the knowledge of our histories. What is the importance of learning about our roots and why do we need to fight for this knowledge? We will discuss the fight for Asian American Studies at Cornell, and how this movement can be expanded to other college campuses. "},
{"key":"36","title":"If Jeremy Lin and Kenyon Martin fight, who wins?  White Supremacy","speaker":"Karen Yiu & Arushi Saini","location":"Rockefeller Hall 115","timeSlot":6,"description":"Horizontal violence occurs when marginalized communities hold each other down, but how do we fix the problem if we do not first recognize our own privilege and bias? Through this workshop, participants will consider the many identities that exist within the Asian American community to better understand how to support the community as a whole. Furthermore, what is the role of Asian American allyship with other marginalized communities and movements such as Black Lives Matter? We will discuss horizontal violence through examples of cultural appropriation and media representation, and discuss how the Asian American community can serve as an agent of change."},
{"key":"37","title":"Critical Nostalgia: Heritage & Asian Artists in the North American Diaspora","speaker":"Florence Yee","location":"Rockefeller Hall 127","timeSlot":6,"description":"Often caught between the White gaze of the art world and our own self-romanticizing pitfalls, visual artists have used critical histories to help dismantle stereotypes of exoticism and Orientalism. At the same time, there are aspects of our identity that could become complicit to settler-colonialism and other forms of oppression if left unspoken. This workshop explores the nuances of dis/empowerment when it comes to denying or including visual elements of our heritage in artwork. It shows the ways in which Asian artists from the diaspora have navigated their identity and its presentation through a critical nostalgia. "},
{"key":"38","title":"Power Mapping","speaker":"Andrew Lo, Stephanie Wong, & Sina Uipi, OCA Asian Pacific American Advocates","location":"Rockefeller Hall 128","timeSlot":6,"description":"When trying to create change and organize your community, it is important to understand how your network works. Who do you need to ally with? Who do you need to convince? Who has the power? We must address all of these questions and more in order to create a more effective campaign for change. "},
{"key":"39","title":"Yolk Inside an Eggshell: Asian Imagery in Western Media","speaker":"Justin Chu, Richard An, & Vinh Dang","location":"Rockefeller Hall 132","timeSlot":6,"description":"\"The title of our workshop, \"\"Yolk Inside an Eggshell: Asian Imagery in Western Media,” draws inspiration from an age-old problem: the superseding of Asian actors and actresses for  Caucasian actors and actresses. This workshop aims to give attendees a perspective on the great achievements of Asian actors/actresses in media from past to present. We will highlight the major issues associated with type casting Asian actresses and actors, as well as bring attention to the representation of Asians in media. Together, we will create our own skits on a moment in our lives when we were stereotyped and underestimated. \""},
{"key":"40","title":"Beyond The Model Minority","speaker":"Grace Vu","location":"Rockefeller Hall 183","timeSlot":6,"description":"“The Model Minority” It’s a term that’s haphazardly tossed around; but, what are the implications of this term used to describe the Asian American population? And how do these implications affect other minorities? Together, we’ll take a look at the relationship between Asian Americans, Black Americans, and White Americans and explore the concepts of racial hierarchy and power dynamics between racial groups. This workshop will revolve around understanding the institution of racism in American society and how it relates to the theories on Racial Triangulation (C. Jean Kim). Identify the stratification of privilege amongst racial groups and engage in rich discussion that digs deeper into what it reallys means to be an Asian American in today’s society. "},
{"key":"41","title":"LGBTQQIA+ Healing Space","speaker":"Kevin Davis & Scott Ho","location":"Rockefeller Hall 185","timeSlot":6,"description":"The point of the workshop is to share the experiences of Asian-American LGBTQQIA+ individuals in a safe space in an attempt to create a sense of community at this conference. This workshop will be held in a roundtable discussion so that everyone can share. There will be no formal hierarchy. Instead the facilitators will act as guides through the discussion. \n\nTrigger/content warning: rape, sexual assault, abuse, self injurious behavior, mental illness, suicide"},
{"key":"42","title":"Establishing the Double Conditional Visibility of Transracially Asian Adoptees in Adoption Media","speaker":"Suzi Birnbaum","location":"Rockefeller Hall 189","timeSlot":6,"description":"This presentation will investigate the excluding nature of the term “Asian American” in the context of Asian-to-American adoption. Transracial adoption films will be used as examples to show how general definitions of Asian American identity are centered around the “Asian American experience” of not only having Asian racial heritage, but also being raised in and identifying with the Asian American culture. When looking at films/documentaries relating to transracial Asian adoption, there is a dominating trope - one that I label the “kinship-roots narrative” - that allows adoptee visibility, but only if it obeys the strict portrayal of an adoptee. The goal of this workshop is to be the alternative representation of adoptees that it calls for."},
{"key":"43","title":"Asian American Activism: Then and Now","speaker":"Raymond Partolan","location":"Rockefeller Hall 230","timeSlot":6,"description":"This workshop will explore the ways in which Asian Americans have historically engaged in advocacy and activism, including their role in the Civil Rights Movement, and flashpoint moments like the Vincent Chin murder. It will also explore the ways advocacy and activism have evolved from then to now, concluding in a discussion about concrete ways to get involved in data-driven strategies to create lasting social change. "},
{"key":"44","title":"Asian American Career Development","speaker":"Joann Ma, Cisco Connection Asian Affinity Network","location":"Rockefeller Hall 231","timeSlot":6,"description":"A panel of diverse early-in-career employees who identify as Asian American will share their stories and experiences to help upcoming graduates understand the challenges and opportunities of corporate America."},
{"key":"45","title":"Reimagining AAPI Identity in Visual Culture","speaker":"Kate Pangilinan & Hannah Song","location":"Rockefeller Hall B16","timeSlot":6,"description":"How do you currently see AAPI voices represented in media? Can you relate? This workshop will take a close look at AAPI representation within tv, film, art, and social media. We aim to create a space where attendees will be able to gain a deeper understanding of the importance of inclusive storytelling, the development of identity, and building shared cultural knowledge. We will provide the framework and questions for people to evaluate the portrayal of AAPI individuals within art, media, and the growing digital landscape. This workshop highlights the responsibility of storytellers (whether written, visual, or through production) to create the future. Through “Reimagining AAPI Identity in Visual Culture,” we allow folx to recognize the impact of each of our authentic voices—encouraging people to have agency and insert new perspectives and conversations into contemporary media culture."},
{"key":"0","title":"(We Are) New Brown America","speaker":"Shivani Parikh","location":"Goldwin Smith Hall 142","timeSlot":5,"description":"\"In Hasan Minhaj's \"\"Homecoming King\"\" Netflix special, he coined the phrase \"\"New Brown America” to name this American-Born (somewhat Confused) Desi generation. What is the South Asian American identity, where do we fit in the broader term of \"\"Asian,\"\" and what does it mean to have the \"\"audacity of equality\"\"? This workshop will open conversation about the post-9/11 criminalization of Desis and explore the movements and coalitions created and fostered by South Asian civil rights organizations, nonprofits, and social justice platforms. We will start and end in a group discussion and identify our hopes and dreams for Desi-Americans' political participation, where the gaps are, and how we as the New Brown America can shape this movement towards collective liberation.\""},
{"key":"1","title":"Pitfalls of Positivity: Using Media Literacy to Think Critically","speaker":"Marcus Tran Degnan","location":"Goldwin Smith Hall 144","timeSlot":5,"description":"This workshop will offer students a space to think more critically about their creative content. It will challenge students by first providing a walkthrough on how to think more in-depth with media analysis of current popular news sources that highlight normative representations of Asian Americans. It will then be followed by a group writing exercise/assignment to emphasize the collaborative nature of the writing process. Students will walk away from this session with an informed discussion on how to develop creativity while being conscious of social justice themes and how they pertain to marginalized people. "},
{"key":"2","title":"Building Power to Fight for Positive Change","speaker":"Kathryn Quintin, APIAVote","location":"Goldwin Smith Hall 181","timeSlot":5,"description":"Are you frustrated at the policies enacted by the recent executive orders? Are you at a loss about what you can do as one person and also as a community? How can one person or a small group make a difference? Learn how to incite the passion in a community to get onboard, get active and do something. This workshop is designed to teach you to be the spark and the fuel to get your campus and community organized and active toward building your collective power. Whether it’s to host a rally, organize a day of action, or push for change in the community let’s talk about how we can activate work together to create a better AAPI community. Let's collectively answer the question of what can we do to create the change we want to see. "},
{"key":"3","title":"Homeland: Finding Place Between Asia and America","speaker":"Ada Zhang, Sabrina Cheung, & Helen Yang","location":"Morrill Hall 106","timeSlot":5,"description":"\"What is home? Constructing an identity around place as an Asian American varies widely from person to person, whether that means choosing \"\"between\"\" Asia and America or shaping an identity that lies somewhere \"\"between\"\" Asia and America. This workshop first delves into the basics of how AAPIs are categorized, touching on the racial binaries of Asia versus America, the perpetual foreigner myth, and AAPI communities' place in America. Then, we will explore and discuss issues pertaining to the idea of \"\"home\"\" for Asian Americans; the search for belonging in Asia or America or both; the relationship with language, culture, and heritage; and the role of place and home in different regions of America.\""},
{"key":"4","title":"Mental Health and Self-Identity","speaker":"JR Kuo, NAAPIMHA","location":"Morrill Hall 107","timeSlot":5,"description":"We will explore their internal and external identities and how that may impact their own health and wellness. We will also focus on empowering ourselves through appreciation of our heritage and strengths. After being able to identify who we are, we will learn how mental health is an essential component of their personal development. Lastly, we will learn from fellow Asian American perspectives and how this can increase their capacities to talk about their identities, mental health, and Asian American issues."},
{"key":"5","title":"Grace Lee Boggs and the Black Radical Tradition","speaker":"Emily Dong & Archishman Raju","location":"Morrill Hall 110","timeSlot":5,"description":"Grace Lee Boggs was a long-time activist, thinker, and revolutionary. She made an essential contribution to a history that defines our time today: from the first March on Washington to the Black Power and revolutionary union movements. With her husband and comrade Jimmy Boggs, she would spend most of her life in Detroit, supporting and leading the struggles throughout the city’s industrial boom and post-industrial devastation. We'll talk about Grace's roots in the Black Radical Tradition, challenge the way current Asian American activist communities frame her, and draw lessons from her ideas and life to inform our own pursuit for transformative justice.  "},
{"key":"6","title":"Diversity at The Department of State - Career and Student Opportunities","speaker":"Sarah Cline","location":"Morrill Hall 111","timeSlot":5,"description":"Recruiter Sarah Cline from the U.S. Department of State will discuss diversity initiatives at the State Department as well as career and student opportunities."},
{"key":"7","title":"Reproductive Rights and Organizing: Our Bodies! Our Freedom!","speaker":"Kenneth Gonzales, Planned Parenthood Action Fund & Alanna Salwen, Planned Parenthood Generation Action","location":"Rockefeller Hall 102","timeSlot":5,"description":"In the last year, we have seen the constant attacks on reproductive healthcare and access globally, nationally, statewide and locally in campuses/universities. However, we have also witnessed the numerous ways communities have defended the attacks on our health, our safety, and our general well-being. Through this workshop, ECAASU participants can expect to engage in conversations around the current fight for reproductive rights and how to take action as young people!"},
{"key":"8","title":"Anti-Blackness in the Blasian Context","speaker":"Savannah Lagmay & Chelsey Gao","location":"Rockefeller Hall 103","timeSlot":5,"description":"When discussing AAPI identity, Blasian-- individuals of mixed African and Asian descent--narratives are often excluded in mainstream conversations. How do we tackle this anti blackness within our own communities? Many factors affect Blasian identity and portrayal in the AAPI community, from history within the US to transnationally in modern media representations. “Anti Blackness in the Blasian Context” aims to discuss experiences being and growing up Blasian, how to prioritize Blasian narratives in the community, and how to navigate conversations of anti blackness from and regarding Blasian perspectives."},
{"key":"9","title":"Race, Gender, and the Construction of Asian American Masculinity","speaker":"Nicholas Hatcher","location":"Rockefeller Hall 104","timeSlot":5,"description":"For people of color, gender is often deviant by default. Black and Latinx men are seen as hyper masculine and women as aggressive or overtly sexual. Asian men are emasculated and Asian women are considered submissive. In this workshop, we explore the history and construction of Asian American masculinity and explore what that means in terms of toxic masculinity, mental health, and queer identity."},
{"key":"10","title":"Breaking the GenerAsianal Boundaries","speaker":"Timothy Chow & Shawn Chen","location":"Rockefeller Hall 105","timeSlot":5,"description":"A discussion about the relationship between Asian-Americans and their parents. In particular, how the contrasting backgrounds and cultures between generations express emotions and how that has affected Asian-Americans growing up. Also, how mainstream media in America has set expectations for family relations. We hope this workshop will encourage Asian-Americans to have an open discussion with their parents."},
{"key":"11","title":"We Are the Ones We’ve Been Waiting For","speaker":"Helena Wong, Israt Audry, Van Sam","location":"Rockefeller Hall 112","timeSlot":5,"description":"AAPIs have always been involved in movements for justice.  In this period of escalated attacks on communities of color, poor communities, LGBTQ people, women's bodies, the environment, etc., it is important for us to build common language and across identities.  Facilitators will work with participants to understand the current moment, and share the work of organizations from across the country who are working to fight systemic racism and articulating a vision for a world we build together."},
{"key":"12","title":"If Jeremy Lin and Kenyon Martin fight, who wins?  White Supremacy","speaker":"Karen Yiu & Arushi Saini","location":"Rockefeller Hall 115","timeSlot":5,"description":"Horizontal violence occurs when marginalized communities hold each other down, but how do we fix the problem if we do not first recognize our own privilege and bias? Through this workshop, participants will consider the many identities that exist within the Asian American community to better understand how to support the community as a whole. Furthermore, what is the role of Asian American allyship with other marginalized communities and movements such as Black Lives Matter? We will discuss horizontal violence through examples of cultural appropriation and media representation, and discuss how the Asian American community can serve as an agent of change."},
{"key":"13","title":"Asian American Christianity","speaker":"Christine Lee & David Choi","location":"Rockefeller Hall 127","timeSlot":5,"description":"Our identities and experiences are made up of many things, one of which often includes faith background. Despite the monumental role of faith in many people’s lives, Asian/Americans in Christian spaces are not often given the space or the language to understand what it means to be both Asian/American and Christian. One might ask: Does my Asianness even matter to God? This workshops seeks to unpack the intersections of these two points of identity, as well as give an introduction to Asian American theology. Folks do not need to be Christian to participate."},
{"key":"14","title":"Advocating Against Adversity","speaker":"Andrew Lo, Stephanie Wong, & Sina Uipi, OCA Asian Pacific American Advocates","location":"Rockefeller Hall 128","timeSlot":5,"description":"Today’s political environment is divisive. This workshop will focus on engaging those who disagree with you. It will break down the different components of constructive and toxic discussions. We will discuss strategies for uncovering the root causes of conflict and methods to facilitate better communication."},
{"key":"15","title":"Yolk Inside an Eggshell: Asian Imagery in Western Media","speaker":"Justin Chu, Richard An, & Vinh Dang","location":"Rockefeller Hall 132","timeSlot":5,"description":"\"The title of our workshop, \"\"Yolk Inside an Eggshell: Asian Imagery in Western Media,” draws inspiration from an age-old problem: the superseding of Asian actors and actresses for  Caucasian actors and actresses. This workshop aims to give attendees a perspective on the great achievements of Asian actors/actresses in media from past to present. We will highlight the major issues associated with type casting Asian actresses and actors, as well as bring attention to the representation of Asians in media. Together, we will create our own skits on a moment in our lives when we were stereotyped and underestimated. \""},
{"key":"16","title":"Beyond the Model Minority","speaker":"Grace Vu","location":"Rockefeller Hall 183","timeSlot":5,"description":"“The Model Minority” It’s a term that’s haphazardly tossed around; but, what are the implications of this term used to describe the Asian American population? And how do these implications affect other minorities? Together, we’ll take a look at the relationship between Asian Americans, Black Americans, and White Americans and explore the concepts of racial hierarchy and power dynamics between racial groups. This workshop will revolve around understanding the institution of racism in American society and how it relates to the theories on Racial Triangulation (C. Jean Kim). Identify the stratification of privilege amongst racial groups and engage in rich discussion that digs deeper into what it reallys means to be an Asian American in today’s society. "},
{"key":"17","title":"Establishing the Double Conditional Visibility of Transracially Asian Adoptees in Adoption Media","speaker":"Suzi Birnbaum","location":"Rockefeller Hall 189","timeSlot":5,"description":"This presentation will investigate the excluding nature of the term “Asian American” in the context of Asian-to-American adoption. Transracial adoption films will be used as examples to show how general definitions of Asian American identity are centered around the “Asian American experience” of not only having Asian racial heritage, but also being raised in and identifying with the Asian American culture. When looking at films/documentaries relating to transracial Asian adoption, there is a dominating trope - one that I label the “kinship-roots narrative” - that allows adoptee visibility, but only if it obeys the strict portrayal of an adoptee. The goal of this workshop is to be the alternative representation of adoptees that it calls for."},
{"key":"18","title":"Someday I’ll Love Me","speaker":"Paul Tran","location":"Rockefeller Hall 230","timeSlot":5,"description":"Writing radical love poems for queer and trans communities “Don’t be afraid,” Ocean Vuong writes in “Someday I’ll Love Ocean Vuong,” after Roger Reeves and Frank O’Hara. And it’s true. In a country where state violence, homelessness, and suicide disproportionately impact communities that are queer, trans, and people of color, fear digs graves for the living and often elude our efforts to triumph, seek happiness, and fulfill our dreams. In this workshop, participants will read Vuong and Reeves. We will talk about what radical love might look like for us and the people we fight for. We will write original work—love poems to us—that confront what we fear most and discuss the role that poetry as self-care plays in every revolution. \n\nTrigger/content warning: suicide"},
{"key":"19","title":"Centering Empathy in Communication","speaker":"Andrea Namkung, Leangelo Acuna, & Kevin Koo","location":"Rockefeller Hall B16","timeSlot":5,"description":"With the varying levels of APIA knowledge and advocacy engagement within student spaces, the ability to navigate personal discussions effectively, yet respectfully, is more important than ever before. This workshop aims to deconstruct elitism surrounding the activist and social justice language used today when discussing APIA issues and also to reimagine what it means to facilitate meaningful communication and center our real-life experiences. We hope that participants will leave with the capacity to facilitate meaningful conversations, with the mindset of playing the educator role without overstepping boundaries, and with a newfound focus on empathy-based organizing and action."},
{"key":"20","title":"My Name Is...","speaker":"Eurie Kim","location":"Rockefeller Hall 110","timeSlot":5,"description":"\"Personally, growing up as an Asian American without an \"\"Americanized\"\" name, I was subject to jokes about my name. These jokes were not necessarily cruel in nature, but for a good amount of time, I think I resented my own name, although eventually, I grew to appreciate and love my name. Through this workshop, I wish to open a discussion of the power of names; what our (as in the APIA community) names mean to us, especially for those of us with non-Americanized first names; and to expand this to question what names we refer to ourselves but also to others outside our community.\"\n\nTrigger/content warning: discussion of racial slurs"},
{"key":"21","title":"The Language Barrier","speaker":"Averill Wong & Yvonne Yang, Cornel Asian & Asian American Center (A3C)","location":"Goldwin Smith Hall 162","timeSlot":5,"description":"The ability to communicate what we feel, share experiences, and form relationships is dictated by the power of language. When we can’t communicate with family and peers, often we lose out on understanding others’ history and culture. This workshop aims to open discussion on the difficulties Asians and Asian Americans might face when conversing to family, friends, and people in another country in a non-native tongue, and how to overcome this barrier."},
{
  "key": 2000,
  "title":"CAUCUS: First-generation, low-income",
  "location": "Rockefeller Hall 102",
  "description": "For those who are the first in their families to attend college/university, and for those who are low-income. (Please do not attend if you are an ally/advocate.)",
  "timeSlot": 10,
  "speaker": "Shelley Shin, Ada Zhang"
}, 
{
  "key": 2001,
  "title":"CAUCUS: Asian American Studies",
  "location":"Goldwin Smith Hall G76",
  "description":"For those who are interested in, studying, or are advocating for Asian American Studies at their home institutions.",
  "timeSlot": 10,
  "speaker": "Sabrina Cheung, Olivia Zheng"
},
{
  "key": 2002,
  "title":"CAUCUS: LGBTQIA+",
  "location":"Goldwin Smith Hall G64",
  "description":"For those who identify as LGBTQIA+, queer, genderqueer/gender nonconforming, or trans. (Please do not attend if you are an ally/advocate.)",
  "timeSlot": 10,
  "speaker": "CHelsey Gao, David Choi"
},
{
  "key": 2003,
  "title":"CAUCUS: Adoptee",
  "location":"Goldwin Smith Hall 181",
  "description":"For those who identify as an adoptee. (Please do not attend if you are an ally/advocate)",
  "timeSlot": 10,
  "speaker": "Lindsay Slater, Katie Nolan"
},
{
  "key": 2004,
  "title":"CAUCUS: Journalism, Media, Arts, Humanities",
  "location":"Goldwin Smith Hall 132",
  "description":"For those who are interested in these topics, and for those who are involved in campus endeavors that provide social commentary. ",
  "timeSlot": 10,
  "speaker": "Kate Pangilinan, Hannah Song"
}, 
{
  "key": 2005,
  "title":"CAUCUS: South Asian, Desi",
  "location":"Rockefeller Hall 122",
  "description":"For those who identify as South Asian, South Asian-American, or Desi. (Please do not attend if you are an ally/advocate.)",
  "timeSlot": 10,
  "speaker": "Shivani Parikh, Aishika Jennela "
}, 
{
  "key": 2006,
  "title":"CAUCUS: Southeast Asian",
  "location":"Rockefeller Hall 115",
  "description":"For those who identify as Southeast Asian.",
  "timeSlot": 10,
  "speaker": "Tony Tran, Huy Tu"
},
{
  "key": 2007,
  "title":"CAUCUS: Native Hawaiian, Pacific Islander",
  "location":"Goldwin Smith Hall 162",
  "description":"For those who identify as Native Hawaiian or Pacific Islander. (Please do not attend if you are an ally/advocate.)",
  "timeSlot": 10,
  "speaker": "Ana Bordallo "
},
{
  "key": 2008,
  "title":"CAUCUS: Coalition Building",
  "location":"Rockefeller Hall 231",
  "description":"For those who are interested in or are currently building multi-racial, multi-ethnic, and/or intersectional movements on their campuses.",
  "timeSlot": 10,
  "speaker": "Leangelo Acuna, Andrea Namkung"
},
{
  "key": 2009,
  "title":"CAUCUS: Mixed Race",
  "location":"Rockefeller Hall 104",
  "description":"For those who identify as mixed or mixed race.",
  "timeSlot": 10,
  "speaker": "Nicholas Hatcher, Maria Pitt"
},
{
  "key": 2010,
  "title":"CAUCUS: Mental Health ",
  "location":"Goldwin Smith Hall 142",
  "description":"For those who are hurting, healing, or want to support those who are hurting and healing. (Allies and advocates are welcome. You will not be asked to disclose any information about your mental health.)",
  "timeSlot": 10,
  "speaker": "NAAPIMHA, Helen Yang"
},
{
  "key": 2011,
  "title":"CAUCUS: AAPI Student Organization Caucus ",
  "location":"Rockefeller Hall 132",
  "description":"For those who are the presidents or serve on leadership of Asian American/AAPI/Umbrella student organizations at their home institutions. ",
  "timeSlot": 10,
  "speaker": "Christine Lee, Kevin Koo"
},
{
  "key": 2012,
  "title":"CAUCUS: Immigrants",
  "location":"Rockefeller Hall 230",
  "description":"For those who identify as immigrants. (Please do not attend if you are an ally/advocate. You will not be asked to disclose any information about your immigration status.)",
  "timeSlot": 10,
  "speaker": "Raymond Partolan"
},
{
  "key": 2013,
  "title":"CAUCUS: Health Care Caucus ",
  "location":"Rockefeller Hall 105",
  "description":"For those who are affected by or interested in reproductive health and women’s rights.",
  "timeSlot": 10,
  "speaker": "Planned Parenthood Generation Action"
},
{
  "key": 2014,
  "title":"CAUCUS: Open Spaces",
  "location":"Goldwin Smith Hall 156, Rockefeller Hall 103, 110, 112",
  "description":"Open rooms for folks to create their own spaces as desired. (Needs to be some sort of infrastructure to publicize these spaces.)",
  "timeSlot": 10,
  "speaker": ""
},
{
  "key": 2015,
  "title":"ALternative: Breakfree Workshop",
  "location":"Physical Sciences Building Atrium",
  "description":"Dance workshop hosted by Cornell’s Breakfree hip-hop crew.",
  "timeSlot": 10,
  "speaker": "Alina Kim "
},
{
  "key": 2016,
  "title":"Alternative: Games Room",
  "location":"Goldwin Smith Hall 144",
  "description":"",
  "timeSlot": 10,
  "speaker": ""
},
{
  "key": 2017,
  "title":"Alternative: Coloring Room",
  "location":"Goldwin Smith Hall 164",
  "description":"",
  "timeSlot": 10,
  "speaker": ""
}
]}